---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings.#ctor
source: html/cb957b49-0af0-8061-88ea-0592df18279b.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings.#ctor Method

Constructs a default instance of legend settings.

## Syntax (C#)
```csharp
public AnalysisDisplayLegendSettings()
```